{"pageProps":{"content":{"title":"Fluoroscopy & Angiography","slug":"fluoroscopy-angiography","excerpt":"This radiology tutorial will orient students to fluoroscopy and angiography including how images are obtained, factors affecting appearance, intraarterial and intravenous contrast agents, indications for use, and guidance for interventional procedures.","pageImage":"/assets/cover-images/computed_tomography_angiography.jpg","homeImage":"/assets/cover-images/psa_iliaca.jpg","date":"2022-06-19T05:35:07.322Z","ogImage":{"url":"http://anatomy.host.dartmouth.edu/graphics/radintro.jpg"},"content":"\n## Introduction\n\nFluoroscopy is a specialized x-ray technique which images moving structures and displays them in real time on a television monitor. Fluoroscopic images look just like x-ray images, as they are obtained with a similar technique.\n\nThe benefit of fluoroscopy is the ability to visualize dynamic processes as they are occurring; think of fluoroscopy as a live x-ray movie. The downside of fluoroscopy, which is important to keep in mind, is the relatively high radiation dose to the patient.\n\nAngiography is the use of fluoroscopy to place catheters and other interventional devices into blood vessels and image blood flow in vessels.\n\n## How Images Are Obtained\n\n### Fluoroscopy Unit\n\nThe patient lies on a specialized table between the x-ray generator and the detector. The generator produces an x-ray beam which travels through the patient towards a specialized detector called the image intensifier.\n\n<Image\n  src=\"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/angio-unit.jpg\"\n  alt=\"fluoroscopy-unit\"\n  wrap=\"right\"\n  size=\"md\"\n/>\n\nThe image intensifier absorbs the transmitted x-rays and emits part of the absorbed energy as light photons. Through a sophisticated process, the number of light photons emitted is amplified and they are converted into a digital image. This is then displayed live on a tv monitor.\n\nThe physician observes the images on the monitor live, as the study is being performed.\n\n### Angiography\n\nAngiography is a general term describing the imaging of blood vessels with x-ray dye. Arteriograms refer to imaging of arteries, while venograms refer to imaging of veins.\n\nAngiograms are obtained by injecting radioopaque contrast material (x-ray dye-just like that used in CT) into a blood vessel. The contrast mixes with the blood in the vessel, and is propelled forward by cardiac action (arteriograms) or towards the heart with venous return (venograms). The flow of the blood/contrast mixture can be observed fluoroscopically, or a sequence of static x-ray images can be obtained.\n\n<Video\n  src=\"https://dartmouth.hosted.panopto.com/Panopto/Pages/Embed.aspx?id=ea34c392-4911-485e-9c5b-acb00151a689&autoplay=false&offerviewer=true&showtitle=false&showbrand=false&start=0&interactivity=all\"\n/>\n\nFluoroscopy is used to guide the placement and the positioning of the catheter into the blood vessel which is being studied.\n\nThe movie on the right is an arteriogram of the lower extremities. The catheter enters the right common femoral artery (catheter appears as a faint black line going across the right femur). The tip of the catheter is in the aorta, and this is where the contrast has been injected.\n\nIt is important to understand these concepts when looking at angiograms:\n\n1. It is the vessel lumen that is being opacified - the vessel wall is not seen.\n2. The images can be displayed with the opacified blood vessels appearing white or black.\n3. You must look at the entire sequence of films, not just one film, in order to interpret angiograms optimally.\n4. The degree of radioopacity produced by a contrast injection will depend on the relative proportions of blood and contrast. As more (unopacified) blood mixes in with the contrast bolus, the vessel lumen will become fainter.\n5. If the heart is not pumping forcefully, and/or if the flow of blood is slow through a region (e.g. the main artery supplying the region is obstructed), the bolus of contrast will move comparatively slowly through the arterial tree.\n\n## Factors Affecting the Appearance\n\nAs fluoroscopy images are live images using x-rays, the same factors which affect the appearance of radiographs will influence the fluoroscopic image, such as density, thickness and shape. Click here if you need to review these factors.\nThe main difference in the appearance of radiographs vs. fluoroscopic images is in the use of contrast. Contrast agents are almost always used to highlight areas of interest and improve the diagnostic yield of the study.\n\nContrast agents can be placed in many different cavities of the body to allow them to be seen, including blood vessels, GI tract, biliary system, CNS, joints, uterus, and the urinary tract. What contrast agent is used will affect the appearance as well.\n\n### Display\n\nImportantly, fluoroscopic images are digital images which can be displayed such that dense structures appear white, like radiographs, or the images can be inverted such that dense structures appear black.\n\n### Intraluminal Contrast Agent: Barium\n\n<br/>\n\n<ImageSlider>\n<Image\n  src=\"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/esophagram.gif\"\n  alt=\"espohagram\"\n  wrap=\"center\"\n  size=\"lg\"\n  caption=\"Barium Esophagram\"\n/>\n<Image\n  src=\"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/be-rlat.gif\"\n  alt=\"be-rlat\"\n  wrap=\"center\"\n  size=\"lg\"\n  caption=\"Barium Enema\"\n/>\n</ImageSlider>\n\nThe first image shows barium which has been swallowed and is traveling down the esophagus into the stomach. Barium is very dense, absorbing much of the incident x-ray beam and so appears white on the film. Without the barium, the stomach and esophagus wouldn't be visible on an x-ray. Barium coats the mucosa and fills the lumen. Note the lungs appear dark and the ribs white, just like on an X-ray.\n\nThe second image is from a barium enema. Through a rectal catheter, barium is instilled into the rectum and flows retrograde into the colon. Its movement is observed fluoroscopically to ensure that the entire colon is coated and evaluated. Air is also instilled into the colon to distend it so that all of the walls are seen. This is called a \"double contrast barium enema\". In this image, the patient has been rolled so that they are lying on their right side. (Note the air-barium level, with the barium located dependently). The flow of barium is observed fluoroscopically as the patient is moved. Barium coats the mucosa of the colon to make it visible on x-rays.\n\n## Intraarterial and Intravenous Contrast\n\nAngiograms (arteriograms and venograms) are obtained by injecting radioopaque contrast directly into a blood vessel via a needle or catheter. The contrast is iodine, which mixes with the blood and attenuates the x-ray beam, making the lumen of the blood vessel high density. The iodine is subsequently filtered through the kidneys and excreted in the urine.\n\nThe forward movement of the contrast bolus that occurs concurrent with venous return (venogram) or arterial flow (arteriogram) is observed fluoroscopically. Without the injected x-ray dye, the blood vessels would not be visible.\n\nAngiograms are displayed digitally, and can be manipulated to show the vessel lumen as white or black. The movie below, of an abdominal aortic angiogram, is \"subtracted\" which means that the bones and other radiodense structures have been subtracted from the image so that only the opacified blood vessels are visible.\n\n<Video\n  src=\"https://dartmouth.hosted.panopto.com/Panopto/Pages/Embed.aspx?id=da06f352-597f-4da5-949a-acb00151ab55&autoplay=false&offerviewer=true&showtitle=false&showbrand=false&start=0&interactivity=all\"\n  caption=\"How Angiography is obtained.\"\n/>\n\n### Intraarticular Contrast Agent: Iodine\n\n#### Arthrography\n\nUnder fluoroscopic guidance, a needle can be placed into a joint, and iodinated contrast can be injected while watching fluoroscopically to better define and outline a joint space or bursa. This is called arthrography. Without the contrast, the joint space or bursa is not visible.\n\nAfter the joint has been injected, it is put through its range of motion to allow for complete filling of the joint space, as well as to assess the capsule, look for fragments or loose bodies in the joint space, and assess the cartilage and underlying bone.\n\nImages from a left shoulder arthrogram are displayed. Dense structures, like bone, appear dark. The injected contrast is dark. Note the size of the joint space, and how far inferiorly it extends. The lower image shows the thickness of the articular cartilage. The white arrows indicate contrast in the joint space and the lucency between this contrast and the bone is the articular cartilage.\n\n<ImageRow\n  srcs={['https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/shouldarthr.gif', 'https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/shouldarthr2.gif']}\n  alts={['shouldarthr', 'shouldarthr2']}\n/>\n\n## Indications for Use\n\nFluoroscopy is used to evaluate dynamic processes and structures in motion. It is used both in the diagnosis and in the treatment of disease. Diagnostic uses include evaluation of swallowing function, study of the gastrointestinal tract, motion of the diaphragm and motion of joints, evaluation of blood vessel patency and size. Therapeutically, it is used in everyday practice as guidance for a wide variety of interventional procedures, performed by radiologists and other specialists.\n\n### Gastrointestinal Tract\n\n<Image\n  src=\"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/indications1sbft.gif\"\n  alt=\"indications1sbft\"\n  wrap=\"right\"\n  size=\"lg\"\n/>\n\nFluoroscopy is invaluable in the evaluation of the gastrointestinal tract. Ingested barium is watched fluoroscopically as it moves throughout the gastrointestinal structures. Things that can be observed fluoroscopically include swallowing function, motility and peristalsis of the esophagus, stomach, small and large bowel, and the rapidity of transit throughout these gastrointestinal structures. The fold pattern, distensibility, and caliber of these structures is also observed.\n\nClinically, fluoroscopy of the GI tract allows diagnosis of obstructions, strictures, abnormal peristalsis, bowel wall edema, and impaired swallowing function such as aspiration into the trachea. The image on the left is an x-ray taken during ingestion of barium under fluoroscopic guidance. Note how well the fold pattern of the small bowel loops is seen, outlined with barium.\n\n### Joint Motion\n\nJoint motion can be observed fluoroscopically. This allows assessment of the range of motion of a joint, and will display any limitations of motion. Joint subluxations can sometimes be detected by having the patient perform certain maneuvers.\n\nThe movie on the right demonstrates the range of motion of the radiocarpal joint as seen fluoroscopically.\n\n<Video\n  src=\"https://dartmouth.hosted.panopto.com/Panopto/Pages/Embed.aspx?id=df2fc60a-abcd-46fe-bbec-acb001518004&autoplay=false&offerviewer=true&showtitle=false&showbrand=false&start=0&interactivity=all\"\n  caption=\"Joint motion assessment via fluoroscopy.\"\n/>\n\n### Arteriography and Arterial Interventions\n\nArteriography is performed to look for areas of narrowing (stenosis), occlusions, aneurysms, traumatic injuries, blood clots, and anomalies of blood vessels.\n\nIn order to perform arteriography, a catheter has to be placed into the blood vessel of interest and iodinated contrast is injected through the catheter. Fluoroscopy is used to guide placement of the catheter in the blood vessel as well as to observe the flowing blood and contrast.\n\n<ImageRow\n  srcs={['https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/sfa-sten2.gif', 'https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/sfa-post-stent.gif']}\n  alts={['sfa-sten2', 'sfa-post-stent']}\n/>\n\nStenosis of blood vessels can also be treated using fluoroscopy to guide in the balloon dilatation of an area of narrowing, or in the placement of a stent, as shown in the images on the right from a lower extremity arteriogram. The arrow in the first image indicates a stenosis of the superficial femoral artery. This prevents adequate blood flow from getting to the more distal leg, causing symptoms of pain. Under fluoroscopic visualization, a wire was advanced down the artery, through the area of narrowing, and over the wire a metal stent was opened in the artery, stretching the area of narrowing. The white arrows in the second arteriogram image show the superior and inferior edges of the stent which was placed across the stenosis. Note the lumen appears widely patent after the stent was placed. The black arrow is pointing to a fine wire in the artery. Interventions have to be performed over a wire, which acts as a conduit over which to deliver the catheters, stents, or balloons.\n\n### Venography\n\nVenograms are used primarily to determine the patency of veins, to look for blood clots, and to look for areas of narrowing.\n\nThe movie on the right is a venogram of the left arm and chest. The contrast has been injected through a small catheter which had been placed into the left antecubital vein. The contrast, mixed with blood, is seen flowing through the left brachial, axillary, subclavian and brachiocephalic veins and into the superior vena cava. The left cephalic vein is also faintly seen.\n\n<Video\n  src=\"https://dartmouth.hosted.panopto.com/Panopto/Pages/Embed.aspx?id=9e7e84c2-0e9f-403e-a15d-acb001519b7b&autoplay=false&offerviewer=true&showtitle=false&showbrand=false&start=0&interactivity=all\"\n  caption=\"Venogram of the left arm and chest.\"\n/>\n\n## Guidance for Interventional Procedures\n\nFluoroscopy provides real time guidance when performing procedures. The target tissue is visualized, and a needle, catheter or wire can be advanced at that target under direct visualization. This increases the accuracy, and decreases the potential complications of procedures.\n\n**Example: Percutaneous drainage of an obstructed renal collecting system**\n\n<ImageSlider>\n<Image\n  src=\"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/pcn-needle.gif\"\n  alt=\"pcn-needle\"\n  wrap=\"center\"\n  size=\"lg\"\n  caption=\"Percutaneous Needle\"\n/>\n<Image\n  src=\"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/pcn-wire.gif\"\n  alt=\"pcn-wire\"\n  wrap=\"center\"\n  size=\"lg\"\n  caption=\"Percutaneous Wire\"\n/>\n<Image\n  src=\"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/pcn-tube.gif\"\n  alt=\"pcn-tube\"\n  wrap=\"center\"\n  size=\"lg\"\n  caption=\"Percutaneous Tube\"\n/>\n</ImageSlider>\n\nThe images above demonstrate a fluoroscopically guided percutaneous nephroureteral stent placement. In the first image, a needle has been advanced into the renal collecting system and contrast injected. In the second image, a wire has been placed through the needle and coiled in the collecting system. In the third image, a tube has been placed over the wire into the lower collecting system and extends down the ureter. The tube carries urine from the renal collecting system to the bladder, bypassing a ureteral obstruction. All of these maneuvers are performed while watching with fluoroscopy.\n\n**Example: Fluoroscopically guided fallopian tube recannalization**\n\n<ImageSlider>\n<Image\n  src=\"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/fallop-recan.gif\"\n  alt=\"fallop-recan\"\n  wrap=\"center\"\n  size=\"lg\"\n  caption=\"Fallopian Tube Recannalization 1\"\n/>\n<Image\n  src=\"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/fallop-recan2.gif\"\n  alt=\"fallop-recan2\"\n  wrap=\"center\"\n  size=\"lg\"\n  caption=\"Fallopian Tube Recannalization 2\"\n/>\n</ImageSlider>\n\nBlocked fallopian tubes is one cause of infertility. The tubes can be opened up again or \"recannalized\" through a relatively minor intervention. Under fluoroscopic guidance, a catheter is placed through the cervix into the lower uterus and contrast is injected. The top image on the right shows that the injected contrast fills the uterine cavity and left fallopian tube. The right fallopian tube is not seen and is occluded.\n\nWhile watching fluoroscopically, a tiny flexible wire and catheter are passed through the occlusion in the right fallopian tube, thus recannalizing it and increasing the patient's chances of conceiving. This is shown in the bottom image.\n\n&nbsp;\n"},"source":{"compiledSource":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nconst {useMDXComponents: _provideComponents} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    h2: \"h2\",\n    p: \"p\",\n    h3: \"h3\",\n    ol: \"ol\",\n    li: \"li\",\n    h4: \"h4\",\n    strong: \"strong\"\n  }, _provideComponents(), props.components), {Image, Video, ImageSlider, ImageRow} = _components;\n  if (!Image) _missingMdxReference(\"Image\", true);\n  if (!ImageRow) _missingMdxReference(\"ImageRow\", true);\n  if (!ImageSlider) _missingMdxReference(\"ImageSlider\", true);\n  if (!Video) _missingMdxReference(\"Video\", true);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.h2, {\n      children: \"Introduction\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Fluoroscopy is a specialized x-ray technique which images moving structures and displays them in real time on a television monitor. Fluoroscopic images look just like x-ray images, as they are obtained with a similar technique.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The benefit of fluoroscopy is the ability to visualize dynamic processes as they are occurring; think of fluoroscopy as a live x-ray movie. The downside of fluoroscopy, which is important to keep in mind, is the relatively high radiation dose to the patient.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Angiography is the use of fluoroscopy to place catheters and other interventional devices into blood vessels and image blood flow in vessels.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"How Images Are Obtained\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Fluoroscopy Unit\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The patient lies on a specialized table between the x-ray generator and the detector. The generator produces an x-ray beam which travels through the patient towards a specialized detector called the image intensifier.\"\n    }), \"\\n\", _jsx(Image, {\n      src: \"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/angio-unit.jpg\",\n      alt: \"fluoroscopy-unit\",\n      wrap: \"right\",\n      size: \"md\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The image intensifier absorbs the transmitted x-rays and emits part of the absorbed energy as light photons. Through a sophisticated process, the number of light photons emitted is amplified and they are converted into a digital image. This is then displayed live on a tv monitor.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The physician observes the images on the monitor live, as the study is being performed.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Angiography\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Angiography is a general term describing the imaging of blood vessels with x-ray dye. Arteriograms refer to imaging of arteries, while venograms refer to imaging of veins.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Angiograms are obtained by injecting radioopaque contrast material (x-ray dye-just like that used in CT) into a blood vessel. The contrast mixes with the blood in the vessel, and is propelled forward by cardiac action (arteriograms) or towards the heart with venous return (venograms). The flow of the blood/contrast mixture can be observed fluoroscopically, or a sequence of static x-ray images can be obtained.\"\n    }), \"\\n\", _jsx(Video, {\n      src: \"https://dartmouth.hosted.panopto.com/Panopto/Pages/Embed.aspx?id=ea34c392-4911-485e-9c5b-acb00151a689&autoplay=false&offerviewer=true&showtitle=false&showbrand=false&start=0&interactivity=all\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Fluoroscopy is used to guide the placement and the positioning of the catheter into the blood vessel which is being studied.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The movie on the right is an arteriogram of the lower extremities. The catheter enters the right common femoral artery (catheter appears as a faint black line going across the right femur). The tip of the catheter is in the aorta, and this is where the contrast has been injected.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"It is important to understand these concepts when looking at angiograms:\"\n    }), \"\\n\", _jsxs(_components.ol, {\n      children: [\"\\n\", _jsx(_components.li, {\n        children: \"It is the vessel lumen that is being opacified - the vessel wall is not seen.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"The images can be displayed with the opacified blood vessels appearing white or black.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"You must look at the entire sequence of films, not just one film, in order to interpret angiograms optimally.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"The degree of radioopacity produced by a contrast injection will depend on the relative proportions of blood and contrast. As more (unopacified) blood mixes in with the contrast bolus, the vessel lumen will become fainter.\"\n      }), \"\\n\", _jsx(_components.li, {\n        children: \"If the heart is not pumping forcefully, and/or if the flow of blood is slow through a region (e.g. the main artery supplying the region is obstructed), the bolus of contrast will move comparatively slowly through the arterial tree.\"\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Factors Affecting the Appearance\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"As fluoroscopy images are live images using x-rays, the same factors which affect the appearance of radiographs will influence the fluoroscopic image, such as density, thickness and shape. Click here if you need to review these factors.\\nThe main difference in the appearance of radiographs vs. fluoroscopic images is in the use of contrast. Contrast agents are almost always used to highlight areas of interest and improve the diagnostic yield of the study.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Contrast agents can be placed in many different cavities of the body to allow them to be seen, including blood vessels, GI tract, biliary system, CNS, joints, uterus, and the urinary tract. What contrast agent is used will affect the appearance as well.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Display\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Importantly, fluoroscopic images are digital images which can be displayed such that dense structures appear white, like radiographs, or the images can be inverted such that dense structures appear black.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Intraluminal Contrast Agent: Barium\"\n    }), \"\\n\", _jsx(\"br\", {}), \"\\n\", _jsxs(ImageSlider, {\n      children: [_jsx(Image, {\n        src: \"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/esophagram.gif\",\n        alt: \"espohagram\",\n        wrap: \"center\",\n        size: \"lg\",\n        caption: \"Barium Esophagram\"\n      }), _jsx(Image, {\n        src: \"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/be-rlat.gif\",\n        alt: \"be-rlat\",\n        wrap: \"center\",\n        size: \"lg\",\n        caption: \"Barium Enema\"\n      })]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The first image shows barium which has been swallowed and is traveling down the esophagus into the stomach. Barium is very dense, absorbing much of the incident x-ray beam and so appears white on the film. Without the barium, the stomach and esophagus wouldn't be visible on an x-ray. Barium coats the mucosa and fills the lumen. Note the lungs appear dark and the ribs white, just like on an X-ray.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The second image is from a barium enema. Through a rectal catheter, barium is instilled into the rectum and flows retrograde into the colon. Its movement is observed fluoroscopically to ensure that the entire colon is coated and evaluated. Air is also instilled into the colon to distend it so that all of the walls are seen. This is called a \\\"double contrast barium enema\\\". In this image, the patient has been rolled so that they are lying on their right side. (Note the air-barium level, with the barium located dependently). The flow of barium is observed fluoroscopically as the patient is moved. Barium coats the mucosa of the colon to make it visible on x-rays.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Intraarterial and Intravenous Contrast\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Angiograms (arteriograms and venograms) are obtained by injecting radioopaque contrast directly into a blood vessel via a needle or catheter. The contrast is iodine, which mixes with the blood and attenuates the x-ray beam, making the lumen of the blood vessel high density. The iodine is subsequently filtered through the kidneys and excreted in the urine.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The forward movement of the contrast bolus that occurs concurrent with venous return (venogram) or arterial flow (arteriogram) is observed fluoroscopically. Without the injected x-ray dye, the blood vessels would not be visible.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Angiograms are displayed digitally, and can be manipulated to show the vessel lumen as white or black. The movie below, of an abdominal aortic angiogram, is \\\"subtracted\\\" which means that the bones and other radiodense structures have been subtracted from the image so that only the opacified blood vessels are visible.\"\n    }), \"\\n\", _jsx(Video, {\n      src: \"https://dartmouth.hosted.panopto.com/Panopto/Pages/Embed.aspx?id=da06f352-597f-4da5-949a-acb00151ab55&autoplay=false&offerviewer=true&showtitle=false&showbrand=false&start=0&interactivity=all\",\n      caption: \"How Angiography is obtained.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Intraarticular Contrast Agent: Iodine\"\n    }), \"\\n\", _jsx(_components.h4, {\n      children: \"Arthrography\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Under fluoroscopic guidance, a needle can be placed into a joint, and iodinated contrast can be injected while watching fluoroscopically to better define and outline a joint space or bursa. This is called arthrography. Without the contrast, the joint space or bursa is not visible.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"After the joint has been injected, it is put through its range of motion to allow for complete filling of the joint space, as well as to assess the capsule, look for fragments or loose bodies in the joint space, and assess the cartilage and underlying bone.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Images from a left shoulder arthrogram are displayed. Dense structures, like bone, appear dark. The injected contrast is dark. Note the size of the joint space, and how far inferiorly it extends. The lower image shows the thickness of the articular cartilage. The white arrows indicate contrast in the joint space and the lucency between this contrast and the bone is the articular cartilage.\"\n    }), \"\\n\", _jsx(ImageRow, {\n      srcs: ['https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/shouldarthr.gif', 'https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/shouldarthr2.gif'],\n      alts: ['shouldarthr', 'shouldarthr2']\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Indications for Use\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Fluoroscopy is used to evaluate dynamic processes and structures in motion. It is used both in the diagnosis and in the treatment of disease. Diagnostic uses include evaluation of swallowing function, study of the gastrointestinal tract, motion of the diaphragm and motion of joints, evaluation of blood vessel patency and size. Therapeutically, it is used in everyday practice as guidance for a wide variety of interventional procedures, performed by radiologists and other specialists.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Gastrointestinal Tract\"\n    }), \"\\n\", _jsx(Image, {\n      src: \"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/indications1sbft.gif\",\n      alt: \"indications1sbft\",\n      wrap: \"right\",\n      size: \"lg\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Fluoroscopy is invaluable in the evaluation of the gastrointestinal tract. Ingested barium is watched fluoroscopically as it moves throughout the gastrointestinal structures. Things that can be observed fluoroscopically include swallowing function, motility and peristalsis of the esophagus, stomach, small and large bowel, and the rapidity of transit throughout these gastrointestinal structures. The fold pattern, distensibility, and caliber of these structures is also observed.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Clinically, fluoroscopy of the GI tract allows diagnosis of obstructions, strictures, abnormal peristalsis, bowel wall edema, and impaired swallowing function such as aspiration into the trachea. The image on the left is an x-ray taken during ingestion of barium under fluoroscopic guidance. Note how well the fold pattern of the small bowel loops is seen, outlined with barium.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Joint Motion\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Joint motion can be observed fluoroscopically. This allows assessment of the range of motion of a joint, and will display any limitations of motion. Joint subluxations can sometimes be detected by having the patient perform certain maneuvers.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The movie on the right demonstrates the range of motion of the radiocarpal joint as seen fluoroscopically.\"\n    }), \"\\n\", _jsx(Video, {\n      src: \"https://dartmouth.hosted.panopto.com/Panopto/Pages/Embed.aspx?id=df2fc60a-abcd-46fe-bbec-acb001518004&autoplay=false&offerviewer=true&showtitle=false&showbrand=false&start=0&interactivity=all\",\n      caption: \"Joint motion assessment via fluoroscopy.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Arteriography and Arterial Interventions\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Arteriography is performed to look for areas of narrowing (stenosis), occlusions, aneurysms, traumatic injuries, blood clots, and anomalies of blood vessels.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"In order to perform arteriography, a catheter has to be placed into the blood vessel of interest and iodinated contrast is injected through the catheter. Fluoroscopy is used to guide placement of the catheter in the blood vessel as well as to observe the flowing blood and contrast.\"\n    }), \"\\n\", _jsx(ImageRow, {\n      srcs: ['https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/sfa-sten2.gif', 'https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/sfa-post-stent.gif'],\n      alts: ['sfa-sten2', 'sfa-post-stent']\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Stenosis of blood vessels can also be treated using fluoroscopy to guide in the balloon dilatation of an area of narrowing, or in the placement of a stent, as shown in the images on the right from a lower extremity arteriogram. The arrow in the first image indicates a stenosis of the superficial femoral artery. This prevents adequate blood flow from getting to the more distal leg, causing symptoms of pain. Under fluoroscopic visualization, a wire was advanced down the artery, through the area of narrowing, and over the wire a metal stent was opened in the artery, stretching the area of narrowing. The white arrows in the second arteriogram image show the superior and inferior edges of the stent which was placed across the stenosis. Note the lumen appears widely patent after the stent was placed. The black arrow is pointing to a fine wire in the artery. Interventions have to be performed over a wire, which acts as a conduit over which to deliver the catheters, stents, or balloons.\"\n    }), \"\\n\", _jsx(_components.h3, {\n      children: \"Venography\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Venograms are used primarily to determine the patency of veins, to look for blood clots, and to look for areas of narrowing.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The movie on the right is a venogram of the left arm and chest. The contrast has been injected through a small catheter which had been placed into the left antecubital vein. The contrast, mixed with blood, is seen flowing through the left brachial, axillary, subclavian and brachiocephalic veins and into the superior vena cava. The left cephalic vein is also faintly seen.\"\n    }), \"\\n\", _jsx(Video, {\n      src: \"https://dartmouth.hosted.panopto.com/Panopto/Pages/Embed.aspx?id=9e7e84c2-0e9f-403e-a15d-acb001519b7b&autoplay=false&offerviewer=true&showtitle=false&showbrand=false&start=0&interactivity=all\",\n      caption: \"Venogram of the left arm and chest.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Guidance for Interventional Procedures\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Fluoroscopy provides real time guidance when performing procedures. The target tissue is visualized, and a needle, catheter or wire can be advanced at that target under direct visualization. This increases the accuracy, and decreases the potential complications of procedures.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Example: Percutaneous drainage of an obstructed renal collecting system\"\n      })\n    }), \"\\n\", _jsxs(ImageSlider, {\n      children: [_jsx(Image, {\n        src: \"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/pcn-needle.gif\",\n        alt: \"pcn-needle\",\n        wrap: \"center\",\n        size: \"lg\",\n        caption: \"Percutaneous Needle\"\n      }), _jsx(Image, {\n        src: \"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/pcn-wire.gif\",\n        alt: \"pcn-wire\",\n        wrap: \"center\",\n        size: \"lg\",\n        caption: \"Percutaneous Wire\"\n      }), _jsx(Image, {\n        src: \"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/pcn-tube.gif\",\n        alt: \"pcn-tube\",\n        wrap: \"center\",\n        size: \"lg\",\n        caption: \"Percutaneous Tube\"\n      })]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The images above demonstrate a fluoroscopically guided percutaneous nephroureteral stent placement. In the first image, a needle has been advanced into the renal collecting system and contrast injected. In the second image, a wire has been placed through the needle and coiled in the collecting system. In the third image, a tube has been placed over the wire into the lower collecting system and extends down the ureter. The tube carries urine from the renal collecting system to the bladder, bypassing a ureteral obstruction. All of these maneuvers are performed while watching with fluoroscopy.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: _jsx(_components.strong, {\n        children: \"Example: Fluoroscopically guided fallopian tube recannalization\"\n      })\n    }), \"\\n\", _jsxs(ImageSlider, {\n      children: [_jsx(Image, {\n        src: \"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/fallop-recan.gif\",\n        alt: \"fallop-recan\",\n        wrap: \"center\",\n        size: \"lg\",\n        caption: \"Fallopian Tube Recannalization 1\"\n      }), _jsx(Image, {\n        src: \"https://anatomy.host.dartmouth.edu/HAE/Radiology_Intro/angio/images/fallop-recan2.gif\",\n        alt: \"fallop-recan2\",\n        wrap: \"center\",\n        size: \"lg\",\n        caption: \"Fallopian Tube Recannalization 2\"\n      })]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Blocked fallopian tubes is one cause of infertility. The tubes can be opened up again or \\\"recannalized\\\" through a relatively minor intervention. Under fluoroscopic guidance, a catheter is placed through the cervix into the lower uterus and contrast is injected. The top image on the right shows that the injected contrast fills the uterine cavity and left fallopian tube. The right fallopian tube is not seen and is occluded.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"While watching fluoroscopically, a tiny flexible wire and catheter are passed through the occlusion in the right fallopian tube, thus recannalizing it and increasing the patient's chances of conceiving. This is shown in the bottom image.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \" \"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = Object.assign({}, _provideComponents(), props.components);\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\nfunction _missingMdxReference(id, component) {\n  throw new Error(\"Expected \" + (component ? \"component\" : \"object\") + \" `\" + id + \"` to be defined: you likely forgot to import, pass, or provide it.\");\n}\n","frontmatter":{},"scope":{}}},"__N_SSG":true}